app/controllers/students_controller.rb

  def create
    @student = Student.new
    @student.first_name = params[:student][:first_name]
    @student.last_name = params[:student][:last_name]
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2017-10-16 19:48:39.825981"], ["updated_at", "2017-10-16 19:48:39.825981"]]

  def update
    @student = Student.find(params[:id])
    @student.update(first_name: params[:student][:first_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["updated_at", "2017-10-16 20:40:20.083072"], ["id", 1]]